{
  "finance": {
    "result": {
      "economicEvents": [
        {
          "timestamp": 1768366800000,
          "timestampString": "2026-01-14",
          "timezone": "America/New_York",
          "count": 2,
          "totalCount": 2,
          "records": [
            {
              "economicEvents": true,
              "event": "Existing Home Sales",
              "countryCode": "US",
              "eventTime": 1768402800000,
              "period": "Dec",
              "actual": "4.35",
              "prior": "4.13",
              "revisedFrom": "4.14",
              "description": "Construction industry provides information on construction output and activity. Such information gives an insight into the supply on the housing and construction market. Rising number of new construction starts or value of construction completed reflects higher consumer and business optimism. Expanding construction indicates growth in the housing market and predicts an increase in the overall economy. However, an excessive supply of new buildings may result in a drop in housing prices. The construction industry is one of the first to go into a recession when the economy declines but also to recover as conditions improve. "
            },
            {
              "economicEvents": true,
              "event": "WPI Fuel YY*",
              "countryCode": "IN",
              "eventTime": 1768372200000,
              "period": "Dec",
              "actual": "-2.31",
              "prior": "-2.27",
              "description": "An index that measures and tracks the changes in price of goods in the stages before the retail level. Wholesale price indexes (WPIs) report monthly to show the average price changes of goods sold in bulk, and they are a group of the indicators that follow growth in the economy. Although some countries still use the WPIs as a measure of inflation"
            }
          ]
        },
        {
          "timestamp": 1768453200000,
          "timestampString": "2026-01-15",
          "timezone": "America/New_York",
          "count": 9,
          "totalCount": 9,
          "records": [
            {
              "economicEvents": true,
              "event": "Retail Sales YY*",
              "countryCode": "BR",
              "eventTime": 1768478400000,
              "period": "Nov",
              "actual": "1.3",
              "prior": "1.1",
              "revisedFrom": "0.9",
              "description": "Retail sales data represents total consumer purchase from retail stores. It provides valuable information about consumer spending which makes up the consumption part of GDP. The most volatile components like autos, gas prices and food prices are often removed from the report to show more underlying demand patterns as changes in sales in these categories are frequently a result of price changes. It is not adjusted for inflation. Spending on services is not included. Rising retail sales indicate stronger economic growth. However, if the increase is larger than forecast, it may be inflationary."
            },
            {
              "economicEvents": true,
              "event": "Retail Sales MM*",
              "countryCode": "BR",
              "eventTime": 1768478400000,
              "period": "Nov",
              "actual": "1",
              "prior": "0.5",
              "description": "Retail sales data represents total consumer purchase from retail stores. It provides valuable information about consumer spending which makes up the consumption part of GDP. The most volatile components like autos, gas prices and food prices are often removed from the report to show more underlying demand patterns as changes in sales in these categories are frequently a result of price changes. It is not adjusted for inflation. Spending on services is not included. Rising retail sales indicate stronger economic growth. However, if the increase is larger than forecast, it may be inflationary."
            },
            {
              "economicEvents": true,
              "event": "Industrial Production YY",
              "countryCode": "EU",
              "eventTime": 1768471200000,
              "period": "Nov",
              "actual": "2.5",
              "prior": "2",
              "revisedFrom": "1.7",
              "description": "Total industry excluding construction The index of production measures changes in the volume of the gross value added created by industry, the branch indices being aggregated by means of a system of weighting according to gross value added at factor cost. "
            },
            {
              "economicEvents": true,
              "event": "Industrial Production MM",
              "countryCode": "EU",
              "eventTime": 1768471200000,
              "period": "Nov",
              "actual": "0.7",
              "prior": "0.8",
              "revisedFrom": "0.7",
              "description": " Total industry excluding construction The index of production measures changes in the volume of the gross value added created by industry, the branch indices being aggregated by means of a system of weighting according to gross value added at factor cost. "
            },
            {
              "economicEvents": true,
              "event": "Eurostat Trade NSA, Eur  *",
              "countryCode": "EU",
              "eventTime": 1768471200000,
              "period": "Nov",
              "actual": "9.9",
              "prior": "18.4",
              "revisedFrom": "17.9",
              "description": "Trade balance, called also net export, is the difference between the value of country's exports and imports, over a period of time. A positive balance (trade surplus) means that exports exceed imports, a negative one means the opposite. Positive trade balance illustrates high competitiveness of country's economy. This strengthens investors' interest in the local currency, appreciating its exchange rate. Extra-Euro Zone13 trade is trade with all countries outside the Euro Zone13, including the Member States not in Euro Zone13. Data prior to 1999 refer to Euro Zone12. External trade in goods are compiled by the European Commission (Eurostat) on a monthly basis following a harmonised methodology set out in European Regulations. "
            },
            {
              "economicEvents": true,
              "event": "Industrial Output YY",
              "countryCode": "GB",
              "eventTime": 1768460400000,
              "period": "Nov",
              "actual": "2.3",
              "prior": "-0.8",
              "revisedFrom": "0.4",
              "description": "NACE Sections C - E; C - Mining and quarrying D - Manufacturing E - Electricity, gas and water supply Chained volume index of gross value added. The monthly Index of Production (IoP) provides a timely indicator of growth in the output of production industries, at constant prices. The IoP shares exactly the same industry coverage as the corresponding quarterly series within Gross Domestic Product (GDP). The monthly IoP is currently published for total production and three broad industry categories:Energy,Manufacturing , Mining and quarrying. "
            },
            {
              "economicEvents": true,
              "event": "Manufacturing Output MM",
              "countryCode": "GB",
              "eventTime": 1768460400000,
              "period": "Nov",
              "actual": "2.1",
              "prior": "0.5",
              "revisedFrom": "0.4",
              "description": "Industry is a basic category of business activity. Firms in the same industry are on the same side of the market, produce goods which are close substitutes and compete for the same customers. For statistical purposes, industries are categorized following a uniform classification code such as Standard Industrial Classification (SIC). Changes in the volume of the physical output of the nation's factories, mines and utilities are measured by the index of industrial production. The figure is calculated as a weighted aggregate of goods and reported in headlines as a percent change from previous months. It is often adjusted by season or weather conditions and thus volatile. However, it is used as a leading indicator and helps in forecasting GDP changes. Rising industrial production figures signify increasing economic growth and can positively influence the sentiment towards local currency. "
            },
            {
              "economicEvents": true,
              "event": "Industrial Output MM",
              "countryCode": "GB",
              "eventTime": 1768460400000,
              "period": "Nov",
              "actual": "1.1",
              "prior": "1.1",
              "revisedFrom": "1.3",
              "description": "NACE Sections C - E; C - Mining and quarrying D - Manufacturing E - Electricity, gas and water supply Chained volume index of gross value added. The monthly Index of Production (IoP) provides a timely indicator of growth in the output of production industries, at constant prices. The IoP shares exactly the same industry coverage as the corresponding quarterly series within Gross Domestic Product (GDP). The monthly IoP is currently published for total production and three broad industry categories:Energy,Manufacturing,Mining and quarrying "
            },
            {
              "economicEvents": true,
              "event": "Manufacturing Output YY",
              "countryCode": "GB",
              "eventTime": 1768460400000,
              "period": "Nov",
              "actual": "2.1",
              "prior": "-0.8",
              "revisedFrom": "-0.2",
              "description": "Industry is a basic category of business activity. Firms in the same industry are on the same side of the market, produce goods which are close substitutes and compete for the same customers. For statistical purposes, industries are categorized following a uniform classification code such as Standard Industrial Classification (SIC). Changes in the volume of the physical output of the nation's factories, mines and utilities are measured by the index of industrial production. The figure is calculated as a weighted aggregate of goods and reported in headlines as a percent change from previous months. It is often adjusted by season or weather conditions and thus volatile. However, it is used as a leading indicator and helps in forecasting GDP changes. Rising industrial production figures signify increasing economic growth and can positively influence the sentiment towards local currency. "
            }
          ]
        },
        {
          "timestamp": 1768539600000,
          "timestampString": "2026-01-16",
          "timezone": "America/New_York",
          "count": 3,
          "totalCount": 3,
          "records": [
            {
              "economicEvents": true,
              "event": "CPI YY",
              "countryCode": "RU",
              "eventTime": 1768579200000,
              "period": "Dec",
              "actual": "5.59",
              "prior": "6.6"
            },
            {
              "economicEvents": true,
              "event": "CPI MM",
              "countryCode": "RU",
              "eventTime": 1768579200000,
              "period": "Dec",
              "actual": "0.32",
              "prior": "0.4",
              "description": "The Consumers Price Index (CPI) measures the rate of price change of goods and services purchased by households. It measures changes in the average level of prices over a period of time. In other words, prices indicator of what is happening to prices consumers are paying for items purchased. With a given starting point or base period which is usually taken as 100, the CPI can be used to compare current period consumer prices with those in the base period. Consumer Price index is the most frequently used indicator of inflation and reflect changes in the cost of acquiring a fixed basket of goods and services by the average consumer. The weights are usually derived from household expenditure surveys. "
            },
            {
              "economicEvents": true,
              "event": "House Starts, Annualized*",
              "countryCode": "CA",
              "eventTime": 1768569300000,
              "period": "Dec",
              "actual": "282.4",
              "prior": "254.1",
              "revisedFrom": "254.6",
              "description": "All starts are seasonally adjusted annual rates (SAAR) that are monthly figures adjusted to remove normal seasonal variation. Construction industry provides information on construction output and activity. Such information gives an insight into the supply on the housing and construction market. Rising number of new construction starts or value of construction completed reflects higher consumer and business optimism. Expanding construction indicates growth in the housing market and predicts an increase in the overall economy. However, an excessive supply of new buildings may result in a drop in housing prices. The construction industry is one of the first to go into a recession when the economy declines but also to recover as conditions improve. "
            }
          ]
        },
        {
          "timestamp": 1768712400000,
          "timestampString": "2026-01-18",
          "timezone": "America/New_York",
          "count": 4,
          "totalCount": 4,
          "records": [
            {
              "economicEvents": true,
              "event": "GDP YY",
              "countryCode": "CN",
              "eventTime": 1768788000000,
              "period": "Q4",
              "actual": "4.5",
              "prior": "4.8",
              "description": "China, Production Approach, Gross Domestic Product, Total, growth rate, Constant Prices, Chg Y/Y GDP measures summary value of goods and services generated in a relevant country or region. A region's gross domestic product, or GDP, is one of the ways for measuring the size of its economy. GDP using the production approach is derived as the sum of gross value added for each industry plus taxes less subsidies on products. Market influence of GDP Unexpectedly high quarterly GDP growth is perceived to be potentially inflationary if the economy is close to full capacity; this, in turn, causes bond prices to drop and yields and interest rates to rise.Larger than expected GDP growth will tend to appreciate the exchange rate as it is expected to lead to higher interest rates. "
            },
            {
              "economicEvents": true,
              "event": "Retail Sales YY",
              "countryCode": "CN",
              "eventTime": 1768788000000,
              "period": "Dec",
              "actual": "0.9",
              "prior": "1.3",
              "description": "China, Retail Sales, Total, growth rate, Current Prices, Chg Y/Y Retail sales data represents total consumer purchase from retail stores. It provides valuable information about consumer spending which makes up the consumption part of GDP.Rising retail sales indicate stronger economic growth. However, if the increase is larger than forecast, it may be inflationary. "
            },
            {
              "economicEvents": true,
              "event": "PPI MM",
              "countryCode": "RU",
              "eventTime": 1768780800000,
              "period": "Dec",
              "prior": "-0.9",
              "description": "The Producer Price Index (PPI) is designed to monitor changes in prices of items at the first important commercial transactions. Producer Price Index (PPI) measures a change in the prices of goods and services, over a span of time, either as they leave their place of production or as they enter the production process. PPI measures a change in the prices received by domestic producers for their outputs or the change in the prices paid by domestic producers for their intermediate inputs. In principle, the PPI should include service industries, but in practice it is limited to the domestic agricultural and industrial sector. "
            },
            {
              "economicEvents": true,
              "event": "PPI YY",
              "countryCode": "RU",
              "eventTime": 1768780800000,
              "period": "Dec",
              "prior": "-1.1",
              "description": "The Producer Price Index (PPI) is designed to monitor changes in prices of items at the first important commercial transactions. Producer Price Index (PPI) measures a change in the prices of goods and services, over a span of time, either as they leave their place of production or as they enter the production process. PPI measures a change in the prices received by domestic producers for their outputs or the change in the prices paid by domestic producers for their intermediate inputs. In principle, the PPI should include service industries, but in practice it is limited to the domestic agricultural and industrial sector. "
            }
          ]
        },
        {
          "timestamp": 1768798800000,
          "timestampString": "2026-01-19",
          "timezone": "America/New_York",
          "count": 4,
          "totalCount": 4,
          "records": [
            {
              "economicEvents": true,
              "event": "CPI BoC Core YY",
              "countryCode": "CA",
              "eventTime": 1768829400000,
              "period": "Dec",
              "actual": "2.8",
              "prior": "2.9",
              "description": "The consumer price index (CPI) is a measure of change over a specified period of time in the general level of prices of goods and services that a given population acquires, uses or pays for consumption. It compares a household's cost for a specific basket of finished goods and services with the cost of the same basket during an earlier benchmark period. A variant of the CPI that excludes eight of the most volatile components prices which-account for 16 per cent of the CPI basket-(fruit, vegetables, gasoline, fuel oil, natural gas, mortgage interest, intercity transportation, and tobacco products) as well as the effect of changes in indirect taxes on the remaining components. "
            },
            {
              "economicEvents": true,
              "event": "CPI Inflation MM",
              "countryCode": "CA",
              "eventTime": 1768829400000,
              "period": "Dec",
              "actual": "-0.2",
              "prior": "0.1",
              "description": "Consumer Price index is the most frequently used indicator. The CPI is defined, more precisely, as an indicator of the changes in consumer prices experienced by Canadians. It is obtained by comparing, through time, the cost of a fixed basket of commodities purchased by Canadian consumers in a particular year. Since the basket contains commodities of unchanging or equivalent quantity and quality, the index reflects only pure price movements. "
            },
            {
              "economicEvents": true,
              "event": "CPI Inflation YY",
              "countryCode": "CA",
              "eventTime": 1768829400000,
              "period": "Dec",
              "actual": "2.4",
              "prior": "2.2",
              "description": "Consumer Price index is the most frequently used indicator. The CPI is defined, more precisely, as an indicator of the changes in consumer prices experienced by Canadians. It is obtained by comparing, through time, the cost of a fixed basket of commodities purchased by Canadian consumers in a particular year. Since the basket contains commodities of unchanging or equivalent quantity and quality, the index reflects only pure price movements. "
            },
            {
              "economicEvents": true,
              "event": "CPI BoC Core MM",
              "countryCode": "CA",
              "eventTime": 1768829400000,
              "period": "Dec",
              "actual": "-0.4",
              "prior": "-0.1",
              "description": "The consumer price index (CPI) is a measure of change over a specified period of time in the general level of prices of goods and services that a given population acquires, uses or pays for consumption. It compares a household's cost for a specific basket of finished goods and services with the cost of the same basket during an earlier benchmark period. All items excluding the eight most volatile components (fruit, vegetables, gasoline, fuel oil, natural gas, mortgage interest, inter-city transportation and tobacco products) as well as the effect of changes in indirect taxes on the remaining components. "
            }
          ]
        },
        {
          "timestamp": 1768885200000,
          "timestampString": "2026-01-20",
          "timezone": "America/New_York",
          "count": 3,
          "totalCount": 3,
          "records": [
            {
              "economicEvents": true,
              "event": "Producer/Import Price MM*",
              "countryCode": "CH",
              "eventTime": 1768894200000,
              "period": "Dec",
              "actual": "-0.2",
              "prior": "-0.5",
              "description": "Switzerland, Producer Prices, Combined index, Index "
            },
            {
              "economicEvents": true,
              "event": "Producer/Import Price YY*",
              "countryCode": "CH",
              "eventTime": 1768894200000,
              "period": "Dec",
              "actual": "-1.8",
              "prior": "-1.6",
              "description": "Switzerland, Producer Prices, Combined index, Index "
            },
            {
              "economicEvents": true,
              "event": "ILO Unemployment Rate*",
              "countryCode": "GB",
              "eventTime": 1768892400000,
              "period": "Nov",
              "actual": "5.1",
              "prior": "5.1",
              "description": "The ILO definition of unemployment covers people who are: not in employment, want a job, have actively sought work in the previous four weeks and are available to start work within the next fortnight or; out of work and have accepted a job which they are waiting to start next fortnight. "
            }
          ]
        },
        {
          "timestamp": 1768971600000,
          "timestampString": "2026-01-21",
          "timezone": "America/New_York",
          "count": 12,
          "totalCount": 12,
          "records": [
            {
              "economicEvents": true,
              "event": "Exports YY",
              "countryCode": "JP",
              "eventTime": 1769039400000,
              "period": "Dec",
              "prior": "6.1",
              "description": "Exports of goods and services consist of transactions in goods and services (sales, barter, gifts or grants) from residents to non-residents. "
            },
            {
              "economicEvents": true,
              "event": "Pending Homes Index",
              "countryCode": "US",
              "eventTime": 1769007600000,
              "period": "Dec",
              "actual": "71.8",
              "prior": "79.2",
              "description": "The Pending Home Sales Index is based on a large national sample, typically representing about 20 percent of transactions for existing-home sales. In developing the model for the index, it was demonstrated that the level of monthly sales-contract activity from 2001 through 2004 closely parallels the level of closed existing-home sales in the following two months. "
            },
            {
              "economicEvents": true,
              "event": "Producer Prices MM",
              "countryCode": "CA",
              "eventTime": 1769002200000,
              "period": "Dec",
              "actual": "-0.6",
              "prior": "0.9",
              "revisedFrom": "1.1",
              "description": "The Industrial Product Price index (IPPI) reflects the prices that producers receive as the goods leave the plant gate. It does not reflect what the consumer pays. Unlike the consumer price index, the IPPI excludes indirect taxes and all the costs that occur between the time when a goods leaves the plant and the time when the final user takes possession of it, including the transportation, wholesale and retail costs. "
            },
            {
              "economicEvents": true,
              "event": "Producer Prices YY",
              "countryCode": "CA",
              "eventTime": 1769002200000,
              "period": "Dec",
              "actual": "4.9",
              "prior": "6.1",
              "revisedFrom": "5.9",
              "description": "The Industrial Product Price index (IPPI) reflects the prices that producers receive as the goods leave the plant gate. It does not reflect what the consumer pays. Unlike the consumer price index, the IPPI excludes indirect taxes and all the costs that occur between the time when a goods leaves the plant and the time when the final user takes possession of it, including the transportation, wholesale and retail costs. "
            },
            {
              "economicEvents": true,
              "event": "Mortgage Market Index",
              "countryCode": "US",
              "eventTime": 1768996800000,
              "actual": "397.2",
              "prior": "348",
              "description": "MBA - Mortgage Bankers Association of America. The Market Index covers all mortgage applications during the week. This includes all conventional and government applications, all fixed-rate mortgages (FRMs), all adjustable-rate mortgages (ARMs), whether for a purchase or to refinance. "
            },
            {
              "economicEvents": true,
              "event": "MBA 30-Yr Mortgage Rate",
              "countryCode": "US",
              "eventTime": 1768996800000,
              "actual": "6.16",
              "prior": "6.18",
              "description": "United States, Mortgage Lending Rates, FRM 30-Year Contract Rate (MBA Sourced) For 80% loan-to-value Mortgage. Sourced through Mortgage Banking Association of America. "
            },
            {
              "economicEvents": true,
              "event": "CPI MM",
              "countryCode": "GB",
              "eventTime": 1768978800000,
              "period": "Dec",
              "actual": "0.4",
              "prior": "-0.2",
              "description": "The consumer prices index (CPI) is the main United Kingdom domestic measure of inflation for macroeconomic purposes. The uses of the retail prices index (RPI) include indexation of pensions, state benefits and index-linked gilts. Both measure the average change from month to month in the prices of consumer goods and services purchased in the UK, although there are differences in coverage and methodology. Both the CPI and the RPI are compiled each month using the same underlying price data, based on a large and representative selection of around 650 individual goods and services for which price movements are measured in around 150 areas throughout the UK. Around 120,000 separate price quotations are used every month to compile the indices. The CPI and RPI can be thought of as measuring the monthly cost of a very large shopping basket comprising all the different kinds of goods and services bought by consumers in the UK. As the prices of individual items in the basket vary over time, the total cost of the basket will change. The spending patterns on "
            },
            {
              "economicEvents": true,
              "event": "CPI YY",
              "countryCode": "GB",
              "eventTime": 1768978800000,
              "period": "Dec",
              "actual": "3.4",
              "prior": "3.2",
              "description": "HICPs are calculated in each Member State of the European Union, according to rules specified in a series of European Regulations developed by the EU statistical office in conjunction with the EU Member States. In the UK, the HICP is known as the CPI, but the two remain one and the same index. The consumer prices index (CPI) is the main United Kingdom domestic measure of inflation for macroeconomic purposes. The uses of the retail prices index (RPI) include indexation of pensions, state benefits and index-linked gilts. Both measure the average change from month to month in the prices of consumer goods and services purchased in the UK, although there are differences in coverage and methodology. Both the CPI and the RPI are compiled each month using the same underlying price data, based on a large and representative selection of around 650 individual goods and services for which price movements are measured in around 150 areas throughout the UK. "
            },
            {
              "economicEvents": true,
              "event": "PPI Core Output MM NSA",
              "countryCode": "GB",
              "eventTime": 1768978800000,
              "period": "Dec",
              "actual": "-0.1",
              "prior": "0",
              "revisedFrom": "0.1",
              "description": "The Producer Price Index (PPI) is a monthly survey that measures the price changes of goods bought and sold by UK manufacturers. The PPI is conducted by the Office for National Statistics (ONS) and provides a key measure of inflation, alongside other indicators such as the Retail Price Index (RPI) and Corporate Services Price Index (CSPI). The output price indices measure change in the prices of goods produced by UK manufacturers (these are often called 'factory gate prices'). "
            },
            {
              "economicEvents": true,
              "event": "PPI Output Prices MM NSA",
              "countryCode": "GB",
              "eventTime": 1768978800000,
              "period": "Dec",
              "actual": "0",
              "prior": "0.1",
              "description": "ONS series ID: PLLU. All manufactured products (home sales) The Producer Price Index (PPI) is designed to monitor changes in prices of items at the first important commercial transactions. The PPI shows the same general pattern of inflation as does Consumer price index, but is more volatile. This is because it is weighted more heavily towards goods that are traded in highly competitive markets and somewhat less sensitive to changes in the cost of labour. In principle, the PPI should include service industries, but in practice it is limited to the domestic agricultural and industrial sector. The prices should be farm-gate prices for the agricultural sector and ex-factory prices for the industrial sector. The PPI is worth watching as a leading indicator of inflation at the consumer level. Price changes at the wholesale level take time to work their way through to the retail store. "
            },
            {
              "economicEvents": true,
              "event": "PPI Input Prices YY NSA",
              "countryCode": "GB",
              "eventTime": 1768978800000,
              "period": "Dec",
              "actual": "0.8",
              "prior": "1.1",
              "description": "The Producer Price Index (PPI) is a monthly survey that measures the price changes of goods bought and sold by UK manufacturers. The PPI is conducted by the Office for National Statistics (ONS) and provides a key measure of inflation, alongside other indicators such as the Retail Price Index (RPI) and Corporate Services Price Index (CSPI). The input price indices measure change in the prices of materials and fuels bought by UK manufacturers for processing. These are not limited to just those materials used in the final product, but also include what is required by the company in its normal day to day running. "
            },
            {
              "economicEvents": true,
              "event": "PPI Output Prices YY NSA",
              "countryCode": "GB",
              "eventTime": 1768978800000,
              "period": "Dec",
              "actual": "3.4",
              "prior": "3.4",
              "description": "ONS series ID: PLLU. All manufactured products (home sales) The Producer Price Index (PPI) is designed to monitor changes in prices of items at the first important commercial transactions. The PPI shows the same general pattern of inflation as does Consumer price index, but is more volatile. This is because it is weighted more heavily towards goods that are traded in highly competitive markets and somewhat less sensitive to changes in the cost of labour. In principle, the PPI should include service industries, but in practice it is limited to the domestic agricultural and industrial sector. The prices should be farm-gate prices for the agricultural sector and ex-factory prices for the industrial sector. The PPI is worth watching as a leading indicator of inflation at the consumer level. Price changes at the wholesale level take time to work their way through to the retail store. "
            }
          ]
        },
        {
          "timestamp": 1769058000000,
          "timestampString": "2026-01-22",
          "timezone": "America/New_York",
          "count": 12,
          "totalCount": 12,
          "records": [
            {
              "economicEvents": true,
              "event": "GfK Consumer Confidence",
              "countryCode": "GB",
              "eventTime": 1769126460000,
              "period": "Jan",
              "prior": "-17",
              "description": "The UK Consumer Confidence Survey from GfK NOP was conducted amongst a sample of 2000 individuals aged 16+ on behalf of the European Commission.Quotas are imposed on age, sex, region and social class to ensure the final sample is representative of the UK population. The figures contained within the Consumer Confidence Barometer have an estimated margin of error of +/-2%.Results for the Consumer Confidence Barometer are available on the last working day of each month at 10.30am "
            },
            {
              "economicEvents": true,
              "event": "Consumer Confid. Flash *",
              "countryCode": "EU",
              "eventTime": 1769126400000,
              "period": "Jan",
              "prior": "-13.1",
              "description": " The indicator is the arithmetic average of the balances (%) for the present and the future business situation, and for stocks - with inverted sign. Balances: i.e. differences between the percentages of respondents giving positive and negative replies. "
            },
            {
              "economicEvents": true,
              "event": "CPI, Core Nationwide YY",
              "countryCode": "JP",
              "eventTime": 1769124600000,
              "period": "Dec",
              "prior": "3",
              "description": "The consumer price index (CPI) is a measure of change over a specified period of time in the general level of prices of goods and services that a given population acquires, uses or pays for consumption. It compares a household's cost for a specific basket of finished goods and services with the cost of the same basket during an earlier benchmark period. "
            },
            {
              "economicEvents": true,
              "event": "CPI, Overall Nationwide",
              "countryCode": "JP",
              "eventTime": 1769124600000,
              "period": "Dec",
              "prior": "2.9",
              "description": "The consumer price index (CPI) is a measure of change over a specified period of time in the general level of prices of goods and services that a given population acquires, uses or pays for consumption. It compares a household's cost for a specific basket of finished goods and services with the cost of the same basket during an earlier benchmark period "
            },
            {
              "economicEvents": true,
              "event": "Core PCE Price Index YY*",
              "countryCode": "US",
              "eventTime": 1769094000000,
              "period": "Nov",
              "prior": "2.8",
              "description": "The personal outlay account shows the uses of income of individuals, enterprises that are owned by households, and nonprofit institutions that serve households. Personal outlays is the sum of personal consumption expenditures, personal interest payments and personal current transfer payments. Personal consumption expenditures is the largest component of GDP as households are the largest consumer of U.S. final product. Personal consumption expenditures measures purchases of goods and services by households and by nonprofit institutions serving households (NPISHs) from private business. It also includes purchases of certain goods and services provided by general government and government enterprises, such as tuition payments for higher education, charges for medical care, and charges for water and other sanitary services. In addition, PCE includes imputed expenditures on items such as the services of housing by a homeowner (the equivalent of rent), financial and insurance services for which there is no explicit charge, and medical care provided to individuals and financed by government or by private insurance. The goods and services purchased by the personal sector. In the NIPA's, the personal sector consists of individuals (and nonprofit institutions serving "
            },
            {
              "economicEvents": true,
              "event": "PCE Price Index YY *",
              "countryCode": "US",
              "eventTime": 1769094000000,
              "period": "Nov",
              "prior": "2.8",
              "description": "The personal outlay account shows the uses of income of individuals, enterprises that are owned by households, and nonprofit institutions that serve households. Personal outlays is the sum of personal consumption expenditures, personal interest payments and personal current transfer payments. Personal consumption expenditures is the largest component of GDP as households are the largest consumer of U.S. final product. Personal consumption expenditures measures purchases of goods and services by households and by nonprofit institutions serving households (NPISHs) from private business. It also includes purchases of certain goods and services provided by general government and government enterprises, such as tuition payments for higher education, charges for medical care, and charges for water and other sanitary services. In addition, PCE includes imputed expenditures on items such as the services of housing by a homeowner (the equivalent of rent), financial and insurance services for which there is no explicit charge, and medical care provided to individuals and financed by government or by private insurance. "
            },
            {
              "economicEvents": true,
              "event": "Dallas Fed PCE*",
              "countryCode": "US",
              "eventTime": 1769094000000,
              "period": "Nov",
              "prior": "1.9",
              "description": "In any given month, the rate of inflation in a price index like the Consumer Price Index or Personal Consumption Expenditures (PCE) can be thought of as a weighted average, or mean, of the rates of change in the prices of all the goods and services that make up the index. Calculating the trimmed-mean PCE inflation rate for a given month involves looking at the price changes for each of the individual components of personal consumption expenditures. The individual price changes are sorted in ascending order from fell the most to rose the most, and a certain fraction of the most extreme observations at both ends of the spectrum are like a skaters best and worst marks thrown out, or trimmed. The inflation rate is then calculated as a weighted average of the remaining components. For the series presented here, 19.4 percent of the weight from the lower tail and 25.4 percent of the weight in the upper tail are trimmed. Those proportions have been chosen, based on historical data, to give the best fit between the trimmed-mean inflation rate and proxies for the true core PCE inflation rate. The resulting inflation measure has been shown to outperform the more conventional excluding food and energy measure as a gauge of core inflation. "
            },
            {
              "economicEvents": true,
              "event": "Core PCE Price Index MM *",
              "countryCode": "US",
              "eventTime": 1769094000000,
              "period": "Nov",
              "prior": "0.2",
              "description": "The personal outlay account shows the uses of income of individuals, enterprises that are owned by households, and nonprofit institutions that serve households. Personal outlays is the sum of personal consumption expenditures, personal interest payments and personal current transfer payments. Personal consumption expenditures is the largest component of GDP as households are the largest consumer of U.S. final product. Personal consumption expenditures measures purchases of goods and services by households and by nonprofit institutions serving households (NPISHs) from private business. It also includes purchases of certain goods and services provided by general government and government enterprises, such as tuition payments for higher education, charges for medical care, and charges for water and other sanitary services. In addition, PCE includes imputed expenditures on items such as the services of housing by a homeowner (the equivalent of rent), financial and insurance services for which there is no explicit charge, and medical care provided to individuals and financed by government or by private insurance. The goods and services purchased by the personal sector. In the NIPA's, the personal sector consists of individuals (and nonprofit institutions serving "
            },
            {
              "economicEvents": true,
              "event": "New Housing Price Index*",
              "countryCode": "CA",
              "eventTime": 1769088600000,
              "period": "Dec",
              "prior": "0",
              "description": "The index measures changes of contractor's selling prices of new residential houses. House price index is a statistic designed to reflect the average change of house prices across the country or a certain area. It ensures that the relative importance of different property types in different regions remains fixed throughout the life of the index. Different adjustment must be used as no two houses are identical. Therefore characteristics such as physical attributes of a house or its location should be included in the calculation if the index. "
            },
            {
              "economicEvents": true,
              "event": "Core PCE Prices Fnal",
              "countryCode": "US",
              "eventTime": 1769088600000,
              "period": "Q3",
              "prior": "0"
            },
            {
              "economicEvents": true,
              "event": "GDP Final",
              "countryCode": "US",
              "eventTime": 1769088600000,
              "period": "Q3",
              "prior": "0"
            },
            {
              "economicEvents": true,
              "event": "Initial Jobless Clm *",
              "countryCode": "US",
              "eventTime": 1769088600000,
              "prior": "198",
              "description": "U.S Labor Department report of initial state jobless benefit claims. Unemployment insurance data for regular state programs. Initial claims - Any notice of unemployment filed: (1) to request a determination of entitlement to and eligibility for compensation or (2) to begin a second or subsequent period of eligibility within a benefit year or period of eligibility. "
            }
          ]
        },
        {
          "timestamp": 1769144400000,
          "timestampString": "2026-01-23",
          "timezone": "America/New_York",
          "count": 4,
          "totalCount": 4,
          "records": [
            {
              "economicEvents": true,
              "event": "U Mich Sentiment Final*",
              "countryCode": "US",
              "eventTime": 1769180400000,
              "period": "Jan",
              "prior": "54"
            },
            {
              "economicEvents": true,
              "event": "Retail Sales Ex-Autos MM",
              "countryCode": "CA",
              "eventTime": 1769175000000,
              "period": "Nov",
              "prior": "-0.6",
              "description": "The North American Industry Classification System (NAICS) was introduced in June 2004. "
            },
            {
              "economicEvents": true,
              "event": "Retail Sales MM",
              "countryCode": "GB",
              "eventTime": 1769151600000,
              "period": "Dec",
              "prior": "-0.1",
              "description": "Retail sales data represents total consumer purchase from retail stores. It provides valuable information about consumer spending which makes up the consumption part of GDP. The most volatile components like autos, gas prices and food prices are often removed from the report to show more underlying demand patterns as changes in sales in these categories are frequently a result of price changes. It is not adjusted for inflation. Spending on services is not included. Rising retail sales indicate stronger economic growth. However, if the increase is larger than forecast, it may be inflationary. "
            },
            {
              "economicEvents": true,
              "event": "Retail Sales YY",
              "countryCode": "GB",
              "eventTime": 1769151600000,
              "period": "Dec",
              "prior": "0.6",
              "description": "Retail sales data represents total consumer purchase from retail stores. It provides valuable information about consumer spending which makes up the consumption part of GDP. The most volatile components like autos, gas prices and food prices are often removed from the report to show more underlying demand patterns as changes in sales in these categories are frequently a result of price changes. It is not adjusted for inflation. Spending on services is not included. Rising retail sales indicate stronger economic growth. However, if the increase is larger than forecast, it may be inflationary. "
            }
          ]
        },
        {
          "timestamp": 1769576400000,
          "timestampString": "2026-01-28",
          "timezone": "America/New_York",
          "count": 3,
          "totalCount": 3,
          "records": [
            {
              "economicEvents": true,
              "event": "Fed Funds Tgt Rate",
              "countryCode": "US",
              "eventTime": 1769626800000,
              "prior": "3.62",
              "description": "The federal funds rate is the interest rate at which depository institutions lend balances at the Federal Reserve to other depository institutions overnight. The Federal Reserve's objective for open market operations has varied over the years. During the 1980s, the focus gradually shifted toward attaining a specified level of the federal funds rate, a process that was largely complete by the end of the decade. Beginning in 1994, the FOMC began announcing changes in its policy stance, and in 1995 it began to explicitly state its target level for the federal funds rate. Since February 2000, the statement issued by the FOMC shortly after each of its meetings usually has included the Committee's assessment of the risks to the attainment of its long-run goals of price stability and sustainable economic growth. "
            },
            {
              "economicEvents": true,
              "event": "BoC Rate Decision",
              "countryCode": "CA",
              "eventTime": 1769611500000,
              "prior": "2.25",
              "description": " THE TARGET FOR THE OVERNIGHT RATE is the main tool used by the Bank of Canada to conduct monetary policy. It tells major financial institutions the average interest rate the Bank of Canada wants to see in the marketplace where they lend each other money for one day, or \"overnight.\" When the Bank changes the Overnight Rate Target, this change usually affects other interest rates, including mortgage rates and prime rates charged by commercial banks. When the Bank changes the Overnight Rate Target, this sends a clear signal about the direction in which it wants short-term interest rates to go. These changes usually lead to moves in the prime rate at commercial banks, which serves as a benchmark for many of their loans. These changes can also indirectly affect mortgage rates, and the interest paid to consumers on bank accounts, GICs, and other savings. "
            },
            {
              "economicEvents": true,
              "event": "Industrial Output YY*",
              "countryCode": "IN",
              "eventTime": 1769596200000,
              "period": "Dec",
              "prior": "6.7",
              "description": "Industry is a basic category of business activity. Firms in the same industry are on the same side of the market, produce goods which are close substitutes and compete for the same customers. For statistical purposes, industries are categorized following a uniform classification code such as Standard Industrial Classification (SIC). Changes in the volume of the physical output of the nations factories, mines and utilities are meaured by the index of industrial production. The figure is calculated as a weighted aggregate of goods and reported in headlines as a percent change from previous months. It is often adjusted by season or weather conditions and thus volatile. However, it is used as a leading indicator and helps in forecasting GDP changes. Rising industrial production figures signify increasing economic growth and can positively influence the sentiment towards local currency."
            }
          ]
        },
        {
          "timestamp": 1769662800000,
          "timestampString": "2026-01-29",
          "timezone": "America/New_York",
          "count": 5,
          "totalCount": 5,
          "records": [
            {
              "economicEvents": true,
              "event": "Retail Sales YY",
              "countryCode": "JP",
              "eventTime": 1769730600000,
              "period": "Dec",
              "prior": "1",
              "revisedFrom": "1.1",
              "description": "Retail sales data represents total consumer purchase from retail stores. It provides valuable information about consumer spending which makes up the consumption part of GDP. The most volatile components like autos, gas prices and food prices are often removed from the report to show more underlying demand patterns as changes in sales in these categories are frequently a result of price changes. It is not adjusted for inflation. Spending on services is not included. Rising retail sales indicate stronger economic growth. However, if the increase is larger than forecast, it may be inflationary. "
            },
            {
              "economicEvents": true,
              "event": "Unemployment Rate",
              "countryCode": "JP",
              "eventTime": 1769729400000,
              "period": "Dec",
              "prior": "2.6",
              "description": " Unemployment per cent of total labour force. Labour force status: Population 15 years old and over is classified as follows according to the activity in which each person was engaged during the survey week. Unemployed: Persons who did not work at all during the survey week, but were currently available for work and were actively seeking a job or were waiting for the results of the past job-seeking activity. Labour force: The employed plus the unemployed. Ratio of unemployed in labour force: (Unemployed) / (Labour Force) * 100 "
            },
            {
              "economicEvents": true,
              "event": "Consumer Confid. Final *",
              "countryCode": "EU",
              "eventTime": 1769680800000,
              "period": "Jan",
              "prior": "0",
              "description": "The indicator represents the arithmetic average of the following questions: - Financial situation over the next 12 months - General economic situation over the next 12 months - Unemployment expectations over the next 12 months - Savings over the next 12 months. - Balances: i.e. differences between the percentages of respondents giving positive and negative replies. "
            },
            {
              "economicEvents": true,
              "event": "Trade",
              "countryCode": "CH",
              "eventTime": 1769670000000,
              "period": "Dec",
              "prior": "3841",
              "description": "Figures exclude precious metals and stones, works of arts and antiques. "
            },
            {
              "economicEvents": true,
              "event": "Consumer Confid. Index*",
              "countryCode": "JP",
              "eventTime": 1769662800000,
              "period": "Jan",
              "prior": "37.2",
              "description": "The survey is conducted on a sample of 5040 households. One-person households, non-Japanese households and student households are excluded from the survey. Consumer perceptions of the following four categories are surveyed: overall livelihood, income growth, employment, and willingness to buy durable goods. Respondents are asked to evaluate on a scale of one to five what they consider the prospects to be for the five subjects over the next six months. Points are then allotted in accordance with the one-to-five scale for each category based on the anticipated effects on consumption. The consumer perception index is calculated by computing the weighted average of the points of the results (component ratio). The consumer confidence index (original figure) is then calculated by simply averaging the four consumer perception indexes (original figures). "
            }
          ]
        },
        {
          "timestamp": 1769749200000,
          "timestampString": "2026-01-30",
          "timezone": "America/New_York",
          "count": 5,
          "totalCount": 5,
          "records": [
            {
              "economicEvents": true,
              "event": "GDP MM",
              "countryCode": "CA",
              "eventTime": 1769779800000,
              "period": "Nov",
              "prior": "-0.3",
              "description": "All industries. Gross domestic product (GDP) by industry according to the 1997 North American Industrial Classification System (NAICS). Gross Domestic Product (GDP) measures summary value of goods and services generated in a relevant country or region. A region's GDP is one of the ways for measuring the size of its economy. There are three main approaches for calculating Gross Domestic Product: - Production approach - The sum of the value added created through the production of goods and services within the economy. - Income approach - Total income generated by the production of goods and services within the economy. - Expenditure approach - Total expenditures on all finished goods and services produced within the economy. "
            },
            {
              "economicEvents": true,
              "event": "IGP-M Inflation Index*",
              "countryCode": "BR",
              "eventTime": 1769770800000,
              "period": "Jan",
              "prior": "-0.01",
              "description": "An index that measures and tracks the changes in price of goods in the stages before the retail level. Wholesale price indexes (WPIs) report monthly to show the average price changes of goods sold in bulk, and they are a group of the indicators that follow growth in the economy. Although some countries still use the WPIs as a measure of inflation, many countries, including the United States, use the producer price index (PPI) instead."
            },
            {
              "economicEvents": true,
              "event": "Unemployment Rate",
              "countryCode": "EU",
              "eventTime": 1769767200000,
              "period": "Dec",
              "prior": "6.3",
              "description": "Unemployment rates represent unemployed persons as a percentage of the labour force. The labour force is the total number of people employed and unemployed. Unemployed persons comprise persons aged 15 to 74 who were: a. Without work during the reference week, b. Currently available for work, i.e. were available for paid employment or self-employment before the end of the two weeks following the reference week, c. Actively seeking work, i.e. had taken specific steps in the four weeks period ending with the reference week to seek paid employment or self-employment or who found a job to start later, i.e. within a period of at most three months. This series covers euro area with 13 Member States (Belgium, Germany, Spain, France, Ireland, Italy, Luxembourg, Netherlands, Austria, Portugal, Slovenia, Finland. "
            },
            {
              "economicEvents": true,
              "event": "KOF Indicator",
              "countryCode": "CH",
              "eventTime": 1769760000000,
              "period": "Jan",
              "prior": "103.4",
              "description": "The previous KOF economic barometer has been published on monthly basis. Following a period of reappraisal and development, this is now being replaced with immediate effect by a new KOF economic barometer with a multi- sectoral design. The new KOF economic barometer will also be published monthly. In the new version, economic patterns in individual sectors (banking, construction and other sectors) will be recorded separately using specific indicators, and then compiled to create the new KOF barometer. In addition to the new design, a new filter method is also being used. "
            },
            {
              "economicEvents": true,
              "event": "Housing Starts YY*",
              "countryCode": "JP",
              "eventTime": 1769749200000,
              "period": "Dec",
              "prior": "-8.5",
              "description": "Data refer to the number of new dwellings started with a floor area of more than 10 square meters, which are intended, for habitation by a household. "
            }
          ]
        },
        {
          "timestamp": 1769922000000,
          "timestampString": "2026-02-01",
          "timezone": "America/New_York",
          "count": 1,
          "totalCount": 1,
          "records": [
            {
              "economicEvents": true,
              "event": "GDP YY Monthly*",
              "countryCode": "RU",
              "eventTime": 1769990400000,
              "period": "Dec",
              "prior": "0.1",
              "description": " A region's gross domestic product, or GDP, is one of the ways for measuring the size of its economy. The GDP of a country is defined as the market value of all final goods and services produced within a country in a given period of time. It is also considered the sum of value added at every stage of production of all final goods and services produced within a country in a given period of time "
            }
          ]
        },
        {
          "timestamp": 1770008400000,
          "timestampString": "2026-02-02",
          "timezone": "America/New_York",
          "count": 1,
          "totalCount": 1,
          "records": [
            {
              "economicEvents": true,
              "event": "ISM Manuf Employment Idx",
              "countryCode": "US",
              "eventTime": 1770044400000,
              "period": "Jan",
              "prior": "44.9",
              "description": "Institute for Supply Management defines supply management as the identification, acquisition,access, positioning and management of resources and related capabilities the organization needs or potentially needs in the attainment of its strategic objectives. Mission ISM exists to lead and serve the supply management profession. "
            }
          ]
        },
        {
          "timestamp": 1770181200000,
          "timestampString": "2026-02-04",
          "timezone": "America/New_York",
          "count": 3,
          "totalCount": 3,
          "records": [
            {
              "economicEvents": true,
              "event": "ISM N-Mfg Employment Idx",
              "countryCode": "US",
              "eventTime": 1770217200000,
              "period": "Jan",
              "prior": "52",
              "description": "The Non-Manufacturing ISM Report On Business is based on data compiled from purchasing and supply executives nationwide. Membership of the Non-Manufacturing Business Survey Committee is diversified by NAICS, based on each industry's contribution to gross domestic product (GDP). The Non-Manufacturing Business Survey Committee responses are divided into the following NAICS code categories: Agriculture, Forestry, Fishing & Hunting; Mining; Utilities; Construction; Wholesale Trade; Retail Trade; Transportation & Warehousing; Information; Finance & Insurance; Real Estate, Rental & Leasing; Professional, Scientific & Technical Services; Management of Companies & Support Services; Educational Services; Health Care & Social Assistance; Arts, Entertainment & Recreation; Accommodation & Food Services; Public Administration; and Other Services (services such as Equipment & Machinery Repairing; Promoting or Administering Religious Activities; Grantmaking; Advocacy; and Providing Dry-Cleaning & Laundry Services, Personal Care Services, Death Care Services, Pet Care Services, Photofinishing Services, Temporary Parking Services, and Dating Services). "
            },
            {
              "economicEvents": true,
              "event": "Producer Prices YY *",
              "countryCode": "EU",
              "eventTime": 1770199200000,
              "period": "Dec",
              "prior": "-1.7",
              "description": "Total industry excluding construction The domestic output price index (or producer price index) for an economic activity measures the average price development of all goods and related services resulting from that activity and sold on the domestic market. The domestic output price index is a business cycle indicator showing the monthly development of transaction prices of economic activities. It can be an early indicator of inflationary pressures in the economy, but it also records the evolution of prices over longer periods of time. The domestic market is defined as customers resident in the same national territory as the observation unit. "
            },
            {
              "economicEvents": true,
              "event": "Producer Prices MM *",
              "countryCode": "EU",
              "eventTime": 1770199200000,
              "period": "Dec",
              "prior": "0.5",
              "description": "Total industry excluding construction The domestic output price index (or producer price index) for an economic activity measures the average price development of all goods and related services resulting from that activity and sold on the domestic market. The domestic output price index is a business cycle indicator showing the monthly development of transaction prices of economic activities. It can be an early indicator of inflationary pressures in the economy, but it also records the evolution of prices over longer periods of time. The domestic market is defined as customers resident in the same national territory as the observation unit. "
            }
          ]
        }
      ]
    },
    "error": null
  }
}